In [1]:
import pandas as pd

In [2]:
import numpy as np

# 1. 재색인
## reindex(  )

In [3]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [4]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
obj2 = obj.reindex(['a','b','c','d','e'])  #e라는 항목은 없기 때문에 널값이 출력됨

In [6]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

새로 설정한 index순서에 맞게 재배열 하고 없는 값은 NaN(결측값 )처리 한다.

In [7]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

fill_value = 0 : 결측값을 0으로 채운다.

In [8]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [16]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [9]:
obj3.reindex(range(6),method='ffill') #ffill : 앞에 있는 값 추가하기 front fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [10]:
obj3.reindex(range(6),method='bfill') #bfill : 뒤에 있는 값 추가하기 back fill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [11]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index = ['a','b','c'],columns = ['Ohio','Texas','California']) #arange함수로 0~9값이 할당됨
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [12]:
frame.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [13]:
frame.reindex(columns = ['Ohio','utah','California'])           #열을 바꾸는 경우

   Ohio  utah  California
a     0   NaN           2
b     3   NaN           5
c     6   NaN           8

# 2. 색인하기, 선택하기, 거르기

In [14]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ['Ohio','Colorado','Utah','New York'],
                   columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 1)데이터 프레임에서 column 선택하기

In [15]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [16]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

## 2) 데이터 프레임에서 row 선택하기

In [17]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [47]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 3) .loc : row, columns을 선택하기

In [19]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [20]:
data.loc['Colorado']

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [53]:
data.loc[['Colorado','Utah'],['three','one']]

          three  one
Colorado      6    4
Utah         10    8

In [21]:
data.iloc[2] # 3번째 행을 가져온 것

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [22]:
data.iloc[2,3] #3번째 행 4번째 열

11

In [56]:
data.loc[:'Utah','two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [61]:
data.loc[data['three']>5,:'three']

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

# 3. 함수 적용과 매핑

In [23]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
f = lambda x: x.max() - x.min()  #함수만들기

In [25]:
data.apply(f)

one      12
two      12
three    12
four     12
dtype: int64

# 4. 정렬

In [26]:
obj = pd.DataFrame(np.arange(8).reshape(2,4),index=['three','one'],columns=['d','a','b','c'])

In [27]:
obj

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

### 1) 행이름 기준 정렬 : sort_index(  )

In [28]:
obj.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

### 2) 열이름 기준 정렬

In [29]:
obj.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [76]:
obj.sort_index(axis=1,ascending =False) #내림차순

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### 3) 값에 따라 정렬 : sort_values(  )

In [30]:
frame = pd.DataFrame({
    'b':[4,7,-3,2],
    'a':[0,1,0,1]
    
})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [31]:
frame.sort_values(by='b')  #어떤 열을 기준으로?  b를 기준으로 값이 작은 것부터

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [32]:
frame.sort_values(by=['a','b']) #두가지 이상일 땐 리스트에 담아서

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

# 5. 기술통계 계산과 요약

### 1) sum( )

In [33]:
frame.sum() #columns의 합

b    10
a     2
dtype: int64

In [88]:
frame.sum(axis=1) #row의 합

0    4
1    8
2   -3
3    3
dtype: int64

### 2) mean( ) , skipna

In [34]:
frame.loc[2,'b']=np.nan

In [35]:
frame

     b  a
0  4.0  0
1  7.0  1
2  NaN  0
3  2.0  1

In [36]:
frame.mean(axis=1,skipna=False)

0    2.0
1    4.0
2    NaN
3    1.5
dtype: float64

In [37]:
frame.mean(axis=1,skipna=True)  #결측치는 무시해라

0    2.0
1    4.0
2    0.0
3    1.5
dtype: float64

### 3)describe( )

In [100]:
frame.describe()  #col별로 요약통계량 알려줘

              b        a
count  3.000000  4.00000
mean   4.333333  0.50000
std    2.516611  0.57735
min    2.000000  0.00000
25%    3.000000  0.00000
50%    4.000000  0.50000
75%    5.500000  1.00000
max    7.000000  1.00000

### 4) 상관관계와 공분산 : corr( ), cov( )

In [38]:
data= pd.DataFrame(np.random.normal(size=16).reshape(4,4))

In [39]:
data

          0         1         2         3
0  0.732956  1.260503 -0.455738  0.600960
1  0.045268 -1.415060  0.888993 -0.363801
2 -1.398885 -0.471919 -0.550174  0.828125
3  0.727360 -0.593111 -0.271252  1.394880

In [40]:
data.corr()  #상관계수

          0         1         2         3
0  1.000000  0.331083  0.143736  0.097188
1  0.331083  1.000000 -0.679553  0.325236
2  0.143736 -0.679553  1.000000 -0.812460
3  0.097188  0.325236 -0.812460  1.000000

In [41]:
data.cov()  #공분산

          0         1         2         3
0  1.007453  0.373708  0.096298  0.071504
1  0.373708  1.264634 -0.510090  0.268094
2  0.096298 -0.510090  0.445535 -0.397511
3  0.071504  0.268094 -0.397511  0.537294

In [42]:
data.corrwith(data[1])   #시리즈와 상관계수 구하기

0    0.331083
1    1.000000
2   -0.679553
3    0.325236
dtype: float64

### 5) 유일 값, 값 세기, 멤버십

In [43]:
obj = pd.Series(['c','a','d','a','a','b','c','b','c','a','c'])
obj

0     c
1     a
2     d
3     a
4     a
5     b
6     c
7     b
8     c
9     a
10    c
dtype: object

In [44]:
#유일 값만 담고있는 시리즈 출력
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [45]:
#시리즈의 도수계산
obj.value_counts()

c    4
a    4
b    2
d    1
dtype: int64

In [46]:
#b랑 c가 들어있는 항목 골라내기
mask = obj.isin(['b','c'])
print(mask)
print(obj[mask])

0      True
1     False
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9     False
10     True
dtype: bool
0     c
5     b
6     c
7     b
8     c
10    c
dtype: object